In [8]:
import pandas as pd
import  numpy as np

In [9]:
my_series = pd.Series([4, 7, -5, 3.5, -1])
my_series

0    4.0
1    7.0
2   -5.0
3    3.5
4   -1.0
dtype: float64

In [10]:
my_series[1]

7.0

In [11]:
my_series[:2]

0    4.0
1    7.0
dtype: float64

In [12]:
my_series[my_series > 0]

0    4.0
1    7.0
3    3.5
dtype: float64

In [33]:
my_series[:2]

0    4.0
1    7.0
dtype: float64

In [34]:
my_series * 10

0    40.0
1    70.0
2   -50.0
3    35.0
4   -10.0
dtype: float64

In [35]:
np.exp(my_series)

0      54.598150
1    1096.633158
2       0.006738
3      33.115452
4       0.367879
dtype: float64

In [36]:
df = pd.DataFrame({
    'name': ['Маша', 'Вася', 'Эдуард'], 
    'age': [25, 8, 48], 
    'job': ['Программист', 'Школьник', 'Big Boss'],
    'salary': [100, 10, 200]
})

In [37]:
df

     name  age          job  salary
0    Маша   25  Программист     100
1    Вася    8     Школьник      10
2  Эдуард   48     Big Boss     200

In [38]:
df['name']

0      Маша
1      Вася
2    Эдуард
Name: name, dtype: object

In [39]:
df[df['age'] > 18]

     name  age          job  salary
0    Маша   25  Программист     100
2  Эдуард   48     Big Boss     200

In [40]:
df['salary'] *= 2
df['salary']

0    200
1     20
2    400
Name: salary, dtype: int64

In [41]:
df.T

                  0         1         2
name           Маша      Вася    Эдуард
age              25         8        48
job     Программист  Школьник  Big Boss
salary          200        20       400

In [45]:
df.loc[1:2]

     name  age       job  salary
1    Вася    8  Школьник      20
2  Эдуард   48  Big Boss     400

In [46]:
df

     name  age          job  salary
0    Маша   25  Программист     200
1    Вася    8     Школьник      20
2  Эдуард   48     Big Boss     400

In [47]:
df.iloc[2]

name        Эдуард
age             48
job       Big Boss
salary         400
Name: 2, dtype: object

In [48]:
df.iloc[:1]

   name  age          job  salary
0  Маша   25  Программист     200